      ******************************************************************
      * Author: Abby Jones
      * Date: 07/22/2018
      * Purpose: Learning Cobol from TYCi21Days
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "HELLO, WORLD.".
            STOP RUN.
       END PROGRAM HELLO-WORLD.
