      ******************************************************************
      * Author: Abby Jones
      * Date: 07/22/2018
      * Purpose: Learning Cobol from TYCi21Days
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. I-AM.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "I AM A COBOL PROGRAMMER.".
            DISPLAY "Well, kinda.".
            DISPLAY 12.067.
            STOP RUN.
       END PROGRAM I-AM.
