      ******************************************************************
      * Author: Abby Jones
      * Date: 07/22/2018
      * Purpose: Learning Cobol from TYCi21Days
      * Tectonics: cobc
      ******************************************************************
000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. JONES-WORLD.
000300 DATA DIVISION.
000400 FILE SECTION.
000500 WORKING-STORAGE SECTION.
000600 PROCEDURE DIVISION.
       JOY-DIVISION.
000700 MAIN-PROCEDURE.
            STOP RUN.
       END PROGRAM JONES-WORLD.
